#include<iostream>
#include<cstdio>
#include<time.h>
using namespace std;

int main()
{
	string xing = 
"赵钱孙李周吴郑王冯陈诸卫蒋沈韩杨朱秦尤许何吕施张"
"孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎"
"鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤"
"滕殷罗毕郝邬安常乐于时傅皮卡齐康伍余元卜顾孟平黄"
"和穆萧尹姚邵堪汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞"
"熊纪舒屈项祝董粱杜阮蓝闵席季麻强贾路娄危江童颜郭"
"梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯咎管卢莫"
"经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚"
"程嵇邢滑裴陆荣翁荀羊於惠甄魏家封芮羿储靳汲邴糜松"
"井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫"
"宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄";

	string ming = "熙圣敬冀锡玺懿奕弈孜祁巳瞿闼茼亚烨腊岢励茂孟鲵聂茗悯沐"
		"劲经京精晶兢景净婧璟敬靖菁久居局驹菊炬举句卷隽娟绢珏军君均俊钧珺骏开凯恺楷康亢考珂科可克恪肯恳空宽匡葵魁琨坤昆崑焜腊来兰蓝澜岚琅朗烺朗乐雷磊丽黎莉里力立理利礼历励荔连莲练联炼廉琏良亮林霖临琳麟令灵岭玲凌龄菱苓流陆龙珑楼鲁路璐律伦仑罗洛珞迈满曼芒矛茂瑁墨莓梅美妹门蒙萌梦米密绵勉冕苗妙民敏珉名茗铭明鸣默谋目木沐牧穆睦娜纳男楠讷妮年念宁农女葩鸥培沛佩配霈朋品平萍苹屏朴普其琦起器奇齐绮旗倚千芊前茜倩强俏勤琴青清晴庆穹琼秋丘求曲全权泉群然仁礽容荣如儒润若森沙山珊善少申参生声师诗石使首书帅澍双水爽思斯肃索台堂韬涛田天亭同童图团婉琬望维伟卫为位味威韦微嵬玮文闻五午武希西先仙献贤弦鲜相翔祥香晓笑谐心辛新欣鑫昕兴行星雄宣炫雪学勋亚岩烟言焱燕雁严彦艳妍延嫣殷阳旸瑶尧耀以义易亦逸意艺依宜毅怡衣仪翼伊益贻懿熠漪昳银印英迎莹影瑛荧咏永勇庸由游右友有优佑幼尤玉宇余雨鱼语羽寓誉元园原员远源圆缘苑月越跃悦玥岳韵云蕴允运芸在再哉早则展占战长章昭哲喆者真振珍贞震臻帧之知治志中忠珠庄宗作";



	int n = 10000;
	srand((int)time(NULL));
	while (n--)
	{
		int tt = ((rand() % 528) / 2) * 2;
		int t2 = ((rand() % ming.length()) / 2) * 2;
		printf("%c%c%c%c\n", xing[tt], xing[tt + 1],ming[t2],ming[t2+1]);
	}
	
	system("pause");
}

